name: "text_encoder"
platform: "onnxruntime_onnx"
max_batch_size: 0  

input [
  {
    name: "input_text"
    data_type: TYPE_INT64
    dims: [-1, 77]  #  77 token đầu vào
  }
]

output [
  {
    name: "text_embeddings"
    data_type: TYPE_FP32
    dims: [-1, -1, 768]  # vector nhúng 768 chiều
  },
  {
    name: "1360"
    data_type: TYPE_FP32
    dims: [-1, 768]  #  vector nhúng 768 chiều
  }
]
