name: "text_encoder"
platform: "onnxruntime_onnx"
max_batch_size: 8
input [
  {
    name: "input_ids"
    data_type: TYPE_INT64
    dims: [ -1 ]
  },
  {
    name: "attention_mask"
    data_type: TYPE_INT64
    dims: [ -1 ]
  }
]
output [
  {
    name: "output"
    data_type: TYPE_FP32
    dims: [ 12, 768 ]
  }
]
instance_group [
  {
    kind: KIND_GPU
    count: 1
  }
]
model_warmup {
  batch_size: 8
}
